{
    "1": {
        "role": "Cloud Engineering - Developer",
        "intro": "We are currently interviewing for the founding team in Hyderabad, India for which we already have a large US customer. We are an Innovation Centre, supporting delivery for our US client, building business process automation, maintaining cloud adoption framework, and developing software. We also do security tools automation, AIOps and machine Learning, Infrastructure as a Code (IaC), DevOps and CI/CD processes, FinOps & Cloud Cost Management.",
        "summary": "We need highly skilled and experienced people for the founding team who also demonstrate our values of respect, empathy, excellence, and fun. Our motto is Innovate, Create, Automate. All people should be willing to work from our center in Hitech City, Hyderabad in flexible work arrangements.",
        "responsibilities": [
            "Use DevOps processes with CI/CD and automation.",
            "Support a variety of projects developing software products and services related to Hybrid and Multi Cloud operations using Cloud Native application development principles.",
            "Build tools to use AI/ML and time series techniques and data driven AIOps.",
            "Contribute to the Digital Transformation of our customer base with products and tools built using Open-Source projects.",
            "Build software to automate internal business processes and customer projects.",
            "Develop and set up new development tools and infrastructure on OCI cloud.",
            "Create ways to automate and improve development and release processes",
            "Integrate with third-party tools via API’s",
            "Participate in engineering design analysis, identification, and recommendation of solutions",
            "Support customers through Jira portal",
            "Build automation for processes",
            "Perform migrations to cloud",
            "Troubleshoot technical problems",
            "Participate in daily scrum calls",
            "Communicate clearly / regularly"
        ],
        "requirements": [
            "Bachelor's Degree in Computer Science with 2-4 years industry experience and/or equivalent work experience",
            "Minimum 4 years of solid development experience (Master’s degree, school project and Co-Ops count towards this).",
            "1-2 years of experience with DevOps tools, Cloud (AWS or any other) and automation engineering experience in a mission-critical environment",
            "Must have experience in programming Python, Linux and JavaScript, Docker and K8s.",
            "Node, Go, Java is highly desirable",
            "Experience with Terraform or Ansible or Puppet",
            "Strong knowledge of object-oriented design, Algorithms, data structures and systems and applications programming",
            "Ability to self-manage assigned tasks and work on multiple projects at the same time",
            "Ability to work independently with minimal direction",
            "Excellent problem-solving skills",
            "Ability to analyze and fix problems quickly",
            "Ability to review code and figure out how it works, and how to improve",
            "Full stack development experience on Linux and opensource technologies."
        ]
    },
    "2": {
        "role": "Senior Oracle Database Administrator",
        "intro": "We are currently interviewing for the founding team in Hyderabad, India for which we already have a large US customer. We are an Innovation Centre, supporting delivery for our US client, building business process automation, maintaining cloud adoption framework, and developing software. We also do security tools automation, AIOps and machine Learning, Infrastructure as a Code (IaC), DevOps and CI/CD processes, FinOps & Cloud Cost Management.",
        "summary": "We need highly skilled and experienced people for the founding team who also demonstrate our values of respect, empathy, excellence, and fun. Our motto is Innovate, Create, Automate. All people should be willing to work from our center in Hitech City, Hyderabad in flexible work arrangements.",
        "responsibilities": [
            "Installation, configuration and upgrading of Oracle server software and related products",
            "Evaluate Oracle features and Oracle related products",
            "Establish and maintain sound backup and recovery policies and procedures",
            "Take care of the Database design and implementation",
            "Implement and maintain database security (create and maintain users and roles, assign privileges)",
            "Perform database tuning and performance monitoring",
            "Perform application tuning and performance monitoring",
            "Setup and maintain documentation and standards",
            "Plan growth and changes (capacity planning)",
            "Work as part of a team and provide 24x7 support when required",
            "Perform general technical trouble shooting and give consultation to development teams",
            "Interface with Oracle Corporation for technical support.",
            "Patch Management and Version Control",
            "Installing and optimizing physical models to the Oracle DB(s) for an OLTP system.",
            "Optimizing the performance of the OLTP DB(s) to support a 3-tier system architecture, utilizing indexing, partitioning and in-memory data grid",
            "Designing and implementing data management processes: security, lifecycle management and operational readiness.",
            "Designing and implementing data conversion solutions via Oracle PL/SQL.",
            "Designing and implementing APIs to enable services and batch-based interconnectivity for healthcare data."
        ],
        "requirements": [
            "Must have done at least 4 Production Oracle database migrations and 4 Production Oracle database upgrades for a US customer",
            "8-12 years of Production Oracle DBA experience in a Linux environment. 12c, 19c",
            "4+ years of Oracle GoldenGate experience",
            "12c, 13c Oracle Enterprise Manager (OEM)",
            "Advanced skills in SQL, PL/SQL",
            "Excellent Database migrations, cloning and troubleshooting skills",
            "8 plus year of Shell scripting",
            "Experience with Oracle Engineered Systems is a Plus",
            "Strong, proven Oracle Database Performance Diagnostic skills (at both the SQL and system levels)",
            "8 plus year of Experience with features such as Oracle Real Application Clusters (RAC), CDB/PDB, Automatic Storage Management (ASM), Active Data Guard, Oracle Enterprise Manager (OEM) and Golden Gate replication",
            "Solid experience with Backup and Recovery using Oracle Recovery Manager (RMAN)",
            "Oracle certification strongly preferred"
        ]
    },
    "3": {
        "role": "PeopleSoft Database Administrator",
        "intro": "We are currently interviewing for the founding team in Hyderabad, India for which we already have a large US customer. We are an Innovation Centre, supporting delivery for our US client, building business process automation, maintaining cloud adoption framework, and developing software. We also do security tools automation, AIOps and machine Learning, Infrastructure as a Code (IaC), DevOps and CI/CD processes, FinOps & Cloud Cost Management.",
        "summary": "We need highly skilled and experienced people for the founding team who also demonstrate our values of respect, empathy, excellence, and fun. Our motto is Innovate, Create, Automate. All people should be willing to work from our center in Hitech City, Hyderabad in flexible work arrangements.",
        "responsibilities": [
            "Responsibility will include configuring application including but not limited to ERP applications PeopleSoft HCM.",
            "Architecting, installing, monitoring and integrating other applications with PeopleSoft.",
            "DBA Oracle-Linux, DBA DB2-z/OS, Performance Tuning, SQL Tuning, Oracle Security, PeopleSoft,",
            "Responsibility will include configuring application (including but not limited to ERP applications PeopleSoft HCM, etc.).",
            "Support and lead major initiatives and coordinate projects including implementing new modules, applying enhancements within PeopleSoft and managing upgrades of the PeopleSoft.",
            "Working closely with network engineers, systems engineers, architects and database administrators.",
            "Lead projects to develop custom applications",
            "Setup, configure, and maintain all PeopleSoft application environments and accompanying Oracle databases in accordance with industry best practices.",
            "Script and automate routine maintenance tasks as appropriate.",
            "Maintain awareness of all Oracle and PeopleSoft software updates.",
            "Proactively monitor and manage PeopleSoft and Oracle system security, health, performance, and trends in capacity utilization.",
            "Isolate technical problems within the PeopleSoft system architecture and independently identify and test possible solutions.",
            "Collaborate with backup administrators to implement, manage, and verify related database and server backups.",
            "Support the development team by troubleshooting issues in Production and non-Production application environments and perform migrations between environments.",
            "Refresh production data into pre-production environments as needed by the development team.",
            "Participate in change management, ensuring that all configuration and People Tools definition changes are appropriate and approved for migration to production"
        ],
        "requirements": [
            "Must have done at least 4 Production Peoplesoft migrations and 4 Production Peoplesoft upgrades for a US customer",
            "8-12 years PeopleSoft Admin experience in a Linux environment.",
            "Strong background and knowledge of SQL and Oracle databases",
            "Experience working in PeopleTools 8.57 or above and HCM (or Finance) 9.2",
            "Experience with running PeopleSoft on Oracle Cloud Infrastructure",
            "Experience with batch scheduling Tools and interfaces architectures",
            "Working knowledge of PeopleSoft development tools including Application Engine, PeopleCode, and SQR",
            "Experiencing supporting PeopleTools components such as Change Assistant, Integration Broker and Elastic search",
            "Experience with major upgrade of PeopleSoft",
            "Experience with applying TAX updates, PUMS",
            "Unix shell scripting",
            "Working knowledge of Disaster Recovery architectures",
            "Solid experience with the following (8 plus years) :",
            "Analyzing issues with SQRs, PeopleCode, Application Engine, process schedulers, application servers, application messaging/ integration broker, and web servers",
            "Performing PeopleSoft environment refresh procedures, system monitoring and maintenance, troubleshooting of PeopleSoft process schedulers",
            "PeopleSoft System Administrator managing a PeopleSoft environment",
            "Migrating PeopleSoft projects between PeopleSoft environments",
            "PeopleSoft Application and People Tools upgrades",
            "Keeping system documentation up to date",
            "Oracle 12c or higher experience with a strong understanding of RDBMS and SQL skills",
            "Experience applying People Tools and PeopleSoft application patches/fixes, PUM",
            "Experience with PeopleSoft 9.2 PIA",
            "Strong understanding/knowledge of PeopleSoft Internet Architecture including security components, specifically in an Oracle Linux and WebLogic hosting environment",
            "PKI experience"
        ]
    },
    "4": {
        "role": "Principal DevOps Engineer",
        "intro": "We are currently interviewing for the founding team in Hyderabad, India for which we already have a large US customer. We are an Innovation Centre, supporting delivery for our US client, building business process automation maintaining cloud adoption framework, and developing software. We also do security tools automation, AIOps and machine Learning, Infrastructure as a Code (IaC), DevOps and CI/CD processes, FinOps & Cloud Cost Management.",
        "summary": "We need highly skilled and experienced people for the founding team who also demonstrate our values of respect, empathy, excellence, and fun. Our motto is Innovate, Create, Automate. All people should be willing to work from our center in Hitech City, Hyderabad in flexible work arrangements.",
        "responsibilities": [
            "Fast-paced and intricate role using DevOps processes with CI/CD and automation.",
            "Mentor junior developers supporting a variety of projects developing software products and services related to hybrid and multi-cloud operations using cloud-native application development principles",
            "Build tools to use AI/ML and time series techniques and data-driven AIOps.",
            "Digital transformation of our customers with products and tools using open-source projects.",
            "Build software to automate several internal business processes and customer projects",
            "Mentor junior team members and set up new development tools and infrastructure for working in a distributed environment",
            "Create ways to automate and improve development and release processes",
            "Research and implement automation in business processes to achieve efficiency",
            "Leverage cloud APIs and integrate them with our internal process and other third-party tools via APIs",
            "Participate in engineering design analysis, identification, and recommendation of solutions",
            "Drive two-week development sprints and manage the demos for the team and internal stakeholders",
            "Work with internal stakeholders to improve processes, team culture, and operating efficiency across the enterprise",
            "Work with project managers to ensure proper project execution activities (based on client needs, ISO process, best practices, Jira tasks)",
            "Lead and manage a team of engineers working on DevOps-related automation projects",
            "Support customers through Jira portal, Build automation for processes, Perform migrations to cloud, troubleshoot technical problems",
            "Lead daily scrum calls and communicate clearly / regularly"
        ],
        "requirements": [
            "Minimum 8-10 years of solid development experience (master’s degree, school project and co-ops count towards this)",
            "4-6 years of experience with DevOps tools, Cloud (AWS or any other) and automation engineering experience in a mission-critical environment",
            "5 years of development experience with multiple Linux distros (RHEL, Ubuntu, CentOS etc.)",
            "Experience working with any tool such as Jira, Jenkins, Travis CI, Git, Bamboo, Splunk, OpsGenie, DataDog, NewRelic, Nagios, etc.",
            "Must have experience in programming Python, Linux and JavaScript.",
            "Node, Go, Java is highly desirable.",
            "Must have experience building and deploying Docker and Kubernetes (AWS EKS, GKE, OpenShift).",
            "Experience working with YAML/JSON/GraphQL",
            "Experience with automated configuration and deployment with Infrastructure as Code (IAC) frameworks: Terraform, Ansible, Puppet.",
            "Familiarity and working knowledge of Cloud Networking (VPC, Load Balancers, NAT, VPN, SD-WAN, Direct Connect, Traffic Shaping, Network Virtualization and DNS)",
            "Knowledge of AI/ML, Deep learning algos",
            "Experience using JavaScript and UI development frameworks (React or Angular)",
            "Experience working in Agile, Scrum and DevOps work environments",
            "Full stack development experience on Linux and opensource technologies",
            "Strong knowledge of object-oriented design, Algorithms, data structures and systems and applications programming",
            "Ability to self-manage assigned tasks and work on multiple projects at the same time",
            "Ability to work independently with minimal direction",
            "Excellent problem-solving skills",
            "Ability to analyze and fix problems quickly",
            "Ability to review code and figure out how it works and how to improve"
        ]
    },
    "5": {
        "role": "Principal Software Engineer",
        "intro": "We are currently interviewing for the founding team in Hyderabad, India for which we already have a large US customer. We are an Innovation Centre, supporting delivery for our US client, building business process automation, maintaining cloud adoption framework, and developing software. We also do security tools automation, AIOps and machine Learning, Infrastructure as a Code (IaC), DevOps and CI/CD processes, FinOps & Cloud Cost Management.",
        "summary": "We need highly skilled and experienced people for the founding team who also demonstrate our values of respect, empathy, excellence, and fun. Our motto is Innovate, Create, Automate. All people should be willing to work from our center in Hitech City, Hyderabad in flexible work arrangements.",
        "responsibilities": [
            "Designing, coding, and debugging software",
            "Improving the performance of existing software",
            "Providing training to other engineers",
            "Maintaining and upgrading existing software",
            "Recommending new technologies that can help increase productivity",
            "Supervising and overseeing the technical aspects of projects",
            "Investigating software-related complaints and making necessary adjustments to ensure optimal software performance",
            "Regularly attending team meetings to discuss projects, brainstorm ideas, and put forward solutions to any issues"
        ],
        "requirements": [
            "Minimum 8-10 years of solid development experience (master’s degree, school project and co-ops count towards this)",
            "4-6 years of experience with DevOps tools, Cloud (AWS or any other) and automation engineering experience in a mission-critical environment",
            "5 years of development experience with multiple Linux distros (RHEL, Ubuntu, CentOS etc.)",
            "Experience working with any tool such as Jira, Jenkins, Travis CI, Git, Bamboo, Splunk, OpsGenie, DataDog, NewRelic, Nagios, etc.",
            "Must have experience in programming Python, Linux and JavaScript.",
            "Node, Go, Java is highly desirable",
            "Must have experience building and deploying Docker and Kubernetes (AWS EKS, GKE, OpenShift)",
            "Experience working with YAML/JSON/GraphQL",
            "Experience with automated configuration and deployment with Infrastructure as Code (IAC) frameworks: Terraform, Ansible, Puppet",
            "Familiarity and working knowledge of Cloud Networking (VPC, Load Balancers, NAT, VPN, SD-WAN, Direct Connect, Traffic Shaping, Network Virtualization and DNS)",
            "Knowledge of AI/ML, Deep learning algos",
            "Experience using JavaScript and UI development frameworks (React or Angular)",
            "Experience working in Agile, Scrum and DevOps work environments",
            "Full stack development experience on Linux and opensource technologies",
            "Strong knowledge of object-oriented design, Algorithms, data structures and systems and applications programming",
            "Ability to self-manage assigned tasks and work on multiple projects at the same time",
            "Ability to work independently with minimal direction",
            "Excellent problem-solving skills",
            "Ability to analyze and fix problems quickly",
            "Ability to review code and figure out how it works and how to improve"
        ]
    }
}
